In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/014.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

,0,1,2,3,4,5
0,NaN,NaN,NaN,"Eaton (R) 941,748","Burgess (D) 994,619","MacGregor (Lib) 99,747"
1,NaN,NaN,NaN,46.3%,48.8%,4.9%
2,County,PR,TP,NaN,NaN,NaN
3,APPLING,19,19,1911,1852,85
4,ATKINSON,6,6,685,667,36

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4    5
3   APPLING  19  19  1911  1852   85
4  ATKINSON   6   6   685   667   36
5     BACON   7   7   960  1086   66
6     BAKER   7   7   291   584   28
7   BALDWIN  16  16  3570  5745  328

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4    5
3   APPLING  1911  1852   85
4  ATKINSON   685   667   36
5     BACON   960  1086   66
6     BAKER   291   584   28
7   BALDWIN  3570  5745  328

In [9]:
df.columns = ['county', 'Chuck Eaton', 'David L. Burgess', 'Paul MacGregor']

In [10]:
df.tail(5)

        county Chuck Eaton David L. Burgess Paul MacGregor
157  WHITFIELD        9362             6089            524
158     WILCOX         883              951             39
159     WILKES        1060             1435             72
160  WILKINSON        1009             1622             79
161      WORTH        2389             2259            145

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county    candidate votes
0   APPLING  Chuck Eaton  1911
1  ATKINSON  Chuck Eaton   685
2     BACON  Chuck Eaton   960
3     BAKER  Chuck Eaton   291
4   BALDWIN  Chuck Eaton  3570

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [16]:
df['office'] = 'Public Service Commission'

In [17]:
df['district'] = '3'

In [ ]:
df['party'] = ''

In [18]:
df.loc[df['candidate'] == 'Chuck Eaton', 'party'] = 'Republican'
df.loc[df['candidate'] == 'David L. Burgess', 'party'] = 'Democrat'
df.loc[df['candidate'] == 'Paul MacGregor', 'party'] = 'Libertarian'

In [19]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Chuck Eaton       Republican     941748
David L. Burgess  Democrat       994619
Paul MacGregor    Libertarian     99747
Name: votes, dtype: int64

In [20]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Public Service Commission,3,Republican,Chuck Eaton,1911
1,ATKINSON,Public Service Commission,3,Republican,Chuck Eaton,685
2,BACON,Public Service Commission,3,Republican,Chuck Eaton,960
3,BAKER,Public Service Commission,3,Republican,Chuck Eaton,291
4,BALDWIN,Public Service Commission,3,Republican,Chuck Eaton,3570

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')